БПКР/src/Catalogs/ТиповыеОперации/ТиповыеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТиповыеОперации</name>
  <tabularSections>
    <name>Хозрасчетный</name>
    <attributes>
      <name>СчетДт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоДт1</name>
      <type>
        <types>String</types>
        <types>AnyRef</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоДт2</name>
      <type>
        <types>String</types>
        <types>AnyRef</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоДт3</name>
      <type>
        <types>String</types>
        <types>AnyRef</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДт</name>
      <type>
        <types>CatalogRef.ПараметрыТиповойОперации</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаДт</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСуммаДт</name>
      <type>
        <types>CatalogRef.ПараметрыТиповойОперации</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетКт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоКт1</name>
      <type>
        <types>String</types>
        <types>AnyRef</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоКт2</name>
      <type>
        <types>String</types>
        <types>AnyRef</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоКт3</name>
      <type>
        <types>String</types>
        <types>AnyRef</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКт</name>
      <type>
        <types>CatalogRef.ПараметрыТиповойОперации</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаКт</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСуммаКт</name>
      <type>
        <types>CatalogRef.ПараметрыТиповойОперации</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>CatalogRef.ПараметрыТиповойОперации</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДвиженияРегистров</name>
    <attributes>
      <name>ИмяРегистра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРегистра</name>
      <type>
        <types>EnumRef.ТипыРегистров</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДвижения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоляРегистра</name>
      <comment>Измерение, Ресурс, Реквизит</comment>
      <type>
        <types>EnumRef.ТипыПолейРегистра</types>
      </type>
    </attributes>
    <attributes>
      <name>НеИзменятьЗначение</name>
      <comment>Используется для получения значения у периодического регистра сведений.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвиженияРегистраНакопления</name>
      <comment>Истина - Приход, Ложь - Расход</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БПКР/src/Documents/ОперацияБух/ОперацияБух.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияБух</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.СчетаФактурыВыписанные</registerRecords>
  <registerRecords>AccumulationRegister.УбыткиПрошлыхЛет</registerRecords>
  <registerRecords>AccumulationRegister.НезавершенноеПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ВозвратДенежныхСредствПодотчетником</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыПоДаннымЕдиногоНалога</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеОС</registerRecords>
  <registerRecords>InformationRegister.СведенияОбИмуществе</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеОСНУ</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыГТД</registerRecords>
  <registerRecords>AccumulationRegister.РеестрЗакупок</registerRecords>
  <registerRecords>InformationRegister.СтажиСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.РеестрВвезенныхМатериальныхРесурсов</registerRecords>
  <registerRecords>AccumulationRegister.ДанныеДляОтчетаПоСФЕжемесячному</registerRecords>
  <registerRecords>InformationRegister.СотрудникиПоТрудовымСоглашениям</registerRecords>
  <registerRecords>InformationRegister.АвансыПодотчетника</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиОсновныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДанныеЗакупочныхАктов</registerRecords>
  <registerRecords>AccumulationRegister.БланкиСчетовФактур</registerRecords>
  <registerRecords>AccumulationRegister.РеестрПриобретенныхМатериальныхРесурсов</registerRecords>
  <registerRecords>InformationRegister.ВыполненныеРаботы</registerRecords>
  <registerRecords>InformationRegister.ТарифыКомандировочных</registerRecords>
  <registerRecords>InformationRegister.НалоговаяВыверка</registerRecords>
  <registerRecords>InformationRegister.СведенияОТранспорте</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисленияОкончание</registerRecords>
  <registerRecords>InformationRegister.СостояниеЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.НДСНаИмпорт</registerRecords>
  <registerRecords>InformationRegister.СведенияПоНалогуНаИмущество</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.НДСГТДИмпорт</registerRecords>
  <registerRecords>InformationRegister.СведенияПоПоказателямИмпорта</registerRecords>
  <registerRecords>AccumulationRegister.ВыпускПродукцииУслуг</registerRecords>
  <registerRecords>InformationRegister.ПараметрыУчетаОС</registerRecords>
  <registerRecords>AccumulationRegister.ПоступлениеТоваров</registerRecords>
  <registerRecords>InformationRegister.ЗаказаннаяПродукция</registerRecords>
  <registerRecords>InformationRegister.СведенияОВвозимыхТоварах</registerRecords>
  <registerRecords>InformationRegister.Профсоюз</registerRecords>
  <registerRecords>InformationRegister.НалоговаяАмортизация</registerRecords>
  <registerRecords>CalculationRegister.Удержания</registerRecords>
  <registerRecords>InformationRegister.СостоянияОС</registerRecords>
  <registerRecords>AccumulationRegister.ВозвратыТоваров</registerRecords>
  <registerRecords>InformationRegister.ТабельПоЧасам</registerRecords>
  <registerRecords>AccumulationRegister.НалогиПоЗаработнойПлате</registerRecords>
  <registerRecords>InformationRegister.СобытияОС</registerRecords>
  <registerRecords>AccumulationRegister.ЗемельныйНалог</registerRecords>
  <registerRecords>InformationRegister.ПлановыеУдержанияНачало</registerRecords>
  <registerRecords>InformationRegister.СведенияОПоступлении</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисленияНачало</registerRecords>
  <registerRecords>AccumulationRegister.ДанныеРеестраГТД</registerRecords>
  <registerRecords>InformationRegister.СтатусыСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ПодоходныйНалог</registerRecords>
  <registerRecords>AccumulationRegister.СоциальныйФонд</registerRecords>
  <registerRecords>InformationRegister.СчетаФактурыПолученные</registerRecords>
  <registerRecords>AccumulationRegister.ВыплаченнаяЗарплата</registerRecords>
  <registerRecords>InformationRegister.ПлановыеУдержанияОкончание</registerRecords>
  <registerRecords>AccumulationRegister.АвансыДоотгрузка</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиНУ</registerRecords>
  <registerRecords>InformationRegister.ПлатежиПоНалогуНаПрибыль</registerRecords>
  <registerRecords>InformationRegister.СведенияОНДСНаИмпорт</registerRecords>
  <registerRecords>InformationRegister.СведенияОбЭСФ</registerRecords>
  <registerRecords>InformationRegister.СоставОС</registerRecords>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <registerRecords>InformationRegister.Сотрудники</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ПараметрыУчетаКомплектовОС</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаОС</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СторнируемыйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТиповаяОперация</name>
    <type>
      <types>CatalogRef.ТиповыеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаРегистровСведений</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРегистровНакопления</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/Catalogs/ТиповыеОперации/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВвестиОперацию(Команда)
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	СпособЗаполнения = "ТиповаяОперация";
	ЗначенияЗаполнения.Вставить("СпособЗаполнения",СпособЗаполнения);
	ЗначенияЗаполнения.Вставить("ТиповаяОперация", ТекСтрока.Ссылка);
	ЗначенияЗаполнения.Вставить("Содержание", ТекСтрока.Наименование);
	СтруктураПараметров = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.ОперацияБух.ФормаОбъекта", СтруктураПараметров);
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы_Печать

// СтандартныеПодсистемы.ПодключаемыеКоманды

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
     ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
     ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
     ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
     ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
